# -*- coding: utf-8 -*-
"""
Created on Fri Dec 22 21:37:19 2023

@author: Алексей
"""

a=int(input())
def Vika(a):
    units = ['', 'один', 'два', 'три', 'четыре', 'пять', 'шесть', 'семь', 'восемь', 'девять']
    teens = ['десять', 'одиннадцать', 'двенадцать', 'тринадцать', 'четырнадцать', 'пятнадцать', 'шестнадцать', 'семнадцать', 'восемнадцать', 'девятнадцать']
    tens = ['', '', 'двадцать', 'тридцать', 'сорок', 'пятьдесят', 'шестьдесят', 'семьдесят', 'восемьдесят', 'девяносто']
    hundreds = ['', 'сто', 'двести', 'триста', 'четыреста', 'пятьсот', 'шестьсот', 'семьсот', 'восемьсот', 'девятьсот']
    if a == 0 :
        print("ноль")
    Vika=a%10
    Sonja=(a//10)%10
    Olesa=a//100
    answer=hundreds[Olesa]+" "
    if Sonja==1:
        answer+=teens[Vika]
    elif Sonja==0:
        answer+=units[Vika]
    else:
        answer+=tens[Sonja]+" "+units[Vika]
    print(answer.strip())
Vika(a)    



